=====================================
Select all fields from a table
=====================================

SELECT * FROM person;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (inclusive_predicate))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (identifier)))))))
    (semi_colon)))

=====================================
Select specific fields from a table
=====================================

SELECT name, address, email FROM person;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier)))))
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier)))))
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier))))))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (identifier)))))))
    (semi_colon)))

=====================================
Select all fields from a specific record
=====================================

SELECT * FROM person:tobie;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (inclusive_predicate))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (record_id
                  (object_key)
                  (record_id_value
                    (record_id_ident)))))))))
    (semi_colon)))

=====================================
Select specific fields from a specific record
=====================================

SELECT name, address, email FROM person:tobie;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier)))))
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier)))))
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier))))))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (record_id
                  (object_key)
                  (record_id_value
                    (record_id_ident)))))))))
    (semi_colon)))

=====================================
Select with alias fields
=====================================

SELECT name AS user_name, address FROM person;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier)))
                (keyword_as)
                (identifier)))
            (inclusive_predicate
              (predicate
                (value
                  (base_value
                    (identifier))))))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (identifier)))))))
    (semi_colon)))

=====================================
Select only a single record
=====================================

SELECT * FROM ONLY person:john;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (inclusive_predicate))
          (from_clause
            (keyword_from)
            (keyword_only)
            (value
              (base_value
                (record_id
                  (object_key)
                  (record_id_value
                    (record_id_ident)))))))))
    (semi_colon)))

=====================================
Select the values of a single field from a table
=====================================

SELECT VALUE name FROM person;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (keyword_value)
            (predicate
              (value
                (base_value
                  (identifier)))))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (identifier)))))))
    (semi_colon)))


=====================================
Select the values of a single field from a specific record
=====================================

SELECT VALUE name FROM person:00e1nc508h9f7v63x72O;

---

(source_file
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (keyword_value)
            (predicate
              (value
                (base_value
                  (identifier)))))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (record_id
                  (object_key)
                  (record_id_value
                    (record_id_ident)))))))))
    (semi_colon)))

=====================================
Select with a comment
=====================================

-- this is a comment
SELECT * FROM person;

---

(source_file
  (comment)
  (expressions
    (expression
      (subquery_statement
        (select_statement
          (select_clause
            (keyword_select)
            (inclusive_predicate))
          (from_clause
            (keyword_from)
            (value
              (base_value
                (identifier)))))))
    (semi_colon)))

